Revit 2024 API
ParameterTypeId.IfcExportElement Property
 "Export to IFC"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId IfcExportElement { get; }
Visual Basic
Public Shared ReadOnly Property IfcExportElement As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ IfcExportElement {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace